{
  "abstract": {
    "version": "12.8",
    "last_updated": "2025-12-14",
    "title": "Principia Metaphysica",
    "subtitle": "A Geometric Unification from M-Theory on TCS G₂ Manifolds",
    "paragraphs": [
      {
        "id": "intro",
        "text": "We present Principia Metaphysica, a geometric unification of the Standard Model, gravity, and cosmology derived from M-theory compactification on a single Twisted Connected Sum G₂ manifold. Beginning in a {D_bulk}-dimensional bulk spacetime of signature (24,2), Sp(2,R) gauge fixing yields an effective {D_after_sp2r}-dimensional intermediate stage, followed by compactification on the G₂ manifold to produce the observed {D_observable}D universe with three chiral fermion generations determined topologically from the flux-dressed Euler characteristic (n_gen = |χ_eff|/48 = {n_gen}).",
        "pm_refs": ["dimensions.D_bulk", "dimensions.D_after_sp2r", "dimensions.D_observable", "topology.n_gen", "topology.chi_eff"]
      },
      {
        "id": "parameters",
        "text": "All {total_predictions} measurable parameters of the extended Standard Model — including quark and lepton masses, mixing angles, gauge couplings, the Higgs boson mass, neutrino mass differences, and cosmological observables — are obtained from the manifold topology, flux quantization, and effective torsion class. Two numerical coefficients are transparently calibrated to the electroweak and GUT scales; the observed Higgs mass constrains one complex structure modulus. The remaining parameters emerge as pure predictions.",
        "pm_refs": ["validation.total_predictions"]
      },
      {
        "id": "validation",
        "text": "{predictions_within_1sigma} of {total_predictions} predictions lie within 1σ of current experimental data, with {exact_matches} exact matches, including the Higgs mass, atmospheric neutrino mass splitting, and the atmospheric mixing angle θ₂₃ = {theta_23}°. Additional geometric predictions — proton decay branching ratios and gravitational wave dispersion — await confirmation by future experiments.",
        "pm_refs": ["validation.predictions_within_1sigma", "validation.total_predictions", "validation.exact_matches", "pmns_matrix.theta_23"]
      }
    ],
    "footnote": {
      "id": "field_names",
      "text": "Historical field names \"Pneuma\" and \"Mashiach\" reflect philosophical origins; modern terminology uses \"Primordial Spinor Field\" and \"Attractor Scalar\"."
    },
    "pm_value_sources": {
      "_note": "All values below are sourced dynamically from theory_output.json via PM object",
      "D_bulk": "dimensions.D_bulk",
      "D_after_sp2r": "dimensions.D_after_sp2r",
      "D_observable": "dimensions.D_observable",
      "n_gen": "topology.n_gen",
      "chi_eff": "topology.chi_eff",
      "predictions_within_1sigma": "validation.predictions_within_1sigma",
      "total_predictions": "validation.total_predictions",
      "exact_matches": "validation.exact_matches",
      "theta_23": "pmns_matrix.theta_23"
    }
  }
}
